{
    "assembly": {
        "image": "hue.assembly.web.6x9.jpg",
        "title": "Assembly",
        "subtitle": "In December 2021, Steven Hue released three experimental electronic tracks, collectively titled Assembly.",
        "copy": "After several years of development in electronic music production and sound design, Hue engaged producer Dan Murtagh to bring Assembly to life.\n\nVocals and acoustic percussion on Night Club Bar and Typhoon–performed by Hue–were recorded at Debasement Studios in Melbourne. All other sounds were designed at Hue’s home studio.\n\nThe completion of Assembly, along with sibling release Brainstare / Manatorquim, was delayed by over 200 days of restrictions due to Covid-19.\n\nOn 10th December 2021, Assembly was independently released on all major streaming platforms.\n\n\"First track, Night Club Bar, retains a feel and sound that is closer to traditional electronica than ambient, but as such provides a classy dub/techno link between his previous work and the later tracks on this EP. This is a song that somehow feels both familiar and fresh at the same time, the choppy, almost quirky beats, the deep, resonant bass, and masterfully placed layering lends this track to feel like something that would be heard in a late night/early morning, smoky bar or on a futuristic sci-fi movie soundtrack. The vocal samples are gorgeous, perfectly positioned in the mix to be simultaneously haunting, beautiful, and to capture a sense of mysteriousness.”\n\n\"Second track, Guadyte’s Lair, is where we begin to see Steven Hue’s confident and competent move into atmospheric/ambient music. This type of music is best enjoyed with the lights off – and when you allow the music to be a storyteller, richly describing the scene to you. ~ muzic.net.nz\n\n”Third and final track, Typhoon somehow nestles nicely in a midspot stylistically between Night Club Bar and Guadyte’s Lair. Starting with a series of droning synth layers, Typhoon teases at being another ambient soundscape similar to Guadyte’s Lair before shattering its own mold by introducing the vocals and dub-esque bass swells.” ~ muzic.net.nz",
        "media": [
            {
                "id": 1,
                "url": "https%3A//api.soundcloud.com/playlists/1360607029&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&font-size: 10px; color: #cccccc;line-break: anywhere;word-break: normal;overflow: hidden;white-space: nowrap;text-overflow: ellipsis; font-family: Interstate,Lucida Grande,Lucida Sans Unicode,Lucida Sans,Garuda,Verdana,Tahoma,sans-serif;font-weight: 100;"
            }
        ]
    },
    "brainstare_manatorquim": {
        "image": "brain-manny-gradient_01_2K.16.9.jpg",
        "title": "Brainstare / Manatorquim",
        "subtitle": "In November 2021, Steven Hue made his solo debut with two genre bending tracks.",
        "copy": "Building on his experience composing and performing with Full Code, Hue setout to blend heavy experimental rock with electronic sounds associated with electronica and drum ‘n bass.\n\nAfter several years of development in electronic music production and sound design, Hue engaged producer Dan Murtagh to bring Brainstare and Manatorquim to life.\n\nVocals, guitar, and drums were recorded at Debasement Studios in Melbourne. Hue performed the vocals on both tracks and the guitar on Manatorquim. Kane Skinner performed drums on both tracks. All other sounds were designed at Hue’s home studio.\n\nThe completion of Brainstare / Manatorquim, along with sibling release, Assembly was delayed by over 200 days of restrictions due to Covid-19.\n\nOn 12th November 2021, Brainstare / Manatorquim was independently released on all major streaming platforms.\n\n\"These two singles are cohesive enough to signal a clear, and mature new direction and approach, yet simultaneously diverse enough to provide an intriguing distinctness to each track and to engage the listener over multiple listens.” ~ muzic.net.nz\n\n\"Then the most musically fascinating thing occurs. The track [Brainstare] feels like it falls apart, while also somehow remaining cohesive. The drumbeat that has propelled the song, the synth lines, the hooks, all drop into strange, angular, sharp edges. There is no simple toe-tap beat anymore, but instead a full world of sound and time to explore.” ~ muzic.net.nz\n\n\"From the slow-burn intro, the held-back drumming, subdued-almost-hushed vocal delivery, and the sparse but effective use of sax/horns, this track [Manatorquim] is a masterclass in the adage of “the whole is greater than the sum of the parts.” Momentum is built, and maintained, by the slow, but near constant development of tension of increasing instrument layers or intensity, which serves the track very well – leading to a satisfying climatic ending.” ~ muzic.net.nz",
        "media": [
            {
                "id": 1,
                "url": "https%3A//api.soundcloud.com/playlists/1345436335&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&font-size: 10px; color: #cccccc;line-break: anywhere;word-break: normal;overflow: hidden;white-space: nowrap;text-overflow: ellipsis; font-family: Interstate,Lucida Grande,Lucida Sans Unicode,Lucida Sans,Garuda,Verdana,Tahoma,sans-serif;font-weight: 100;"
            }
        ]
    },
    "fullcode": {
        "image": "fullcode_bg.jpg",
        "title": "Full Code",
        "subtitle": "Steven Hue is the former vocalist and co-writer for experimental rock band Full Code",
        "copy": "Formed in 2005, Full Code was the union of four disparate souls who began to find themselves and each other while studying at the Nelson School of Music.\n\nDrawing from the member’s divergent influences, the band’s exciting fusion of prog/psych rock, metal sensibility, and an incredible live expression of drum and bass, replacing sequencing and sampling with live drum breaks and guitar-generated synths, wowed crowds at venues throughout New Zealand.\n\nPraise came thick and fast for Full Code’s lush sonic landscapes that stretch unhindered over densely forested plains bearing unexpected fruit for the mind, heart and soul. Every aural scene is perfectly complemented by Hue’s impressive vocal range, poignant lyrics and catchy melodies.\n\nThe band released a self-titled EP in 2009 before relocating from Auckland to Australia.\n\nIn 2014, Full Code released their first studio album, Telescapes, produced by Dan Murtagh and mastered by Forrester Savell at Sing Sing Studios in Melbourne.\n\nMelding infinite sounds and musical possibilities, Telescapes defies easy classification. Suffice to say it is music that is medicine for the soul.\n\n\"The marriage of beautiful and powerful vocals, oscillating synths and drumming on a level beyond human yet so human has created a masterpiece for the ages.\" ~ Daedric Influence\n\n\"a Progressive vocalist par excellence.\" ~ I Probably Hate Your Band\n\n\"Anyone who says anything along the lines of 'nobody's doing anything new in rock music these days' needs to be given a thorough education, and Telescapes is a great place to start. If ever a single album could change the minds of the narrow minded, this is it\" ~ Beat Magazine.\n\n\"The quartet's experimentally-tilted yet densely-constructed compositions traverse territory that's at turns atmospheric, visceral, and ear-opening\" ~ Tone Deaf.",
        "media": [
            {
                "id": 1,
                "url": "https://youtu.be/uzVfUptiEp8"
            },
            {
                "id": 2,
                "url": "https://soundcloud.com/fullcodemusic/sets/telescapes"
            }
        ]
    },
    "challenge_haus": {
        "image": "ch.jpg",
        "title": "Challenge Haus",
        "subtitle": "Challenge Haus is a safe domain in which Steven Hue unleashes his weirdest forms of creative expression.",
        "copy": "With an array of talented and suitably twisted collaborators, Hue is the beating heart that powers Challenge Haus’ absurdist, post-slapstick idiot-core video content.\n\nFor Hue, the Haus is something of a museum in the making, a bastion of avante-garde in which he obsessively curates artworks destined to be appreciated as works of genius once his audience takes the inevitably insane leap of faith needed to comprehend them.\n\nWhen locked in the Haus, Hue dons many hats - as writer, director, actor, editor and sound designer.\n\n",
        "media": [
            {
                "id": 1,
                "url": "https://www.youtube.com/playlist?list=PLldMR-5ZfAop8mjebRKF2jlLgSWQVekjy"
            }
        ]
    },
    "tir": {
        "image": "tir.jpg",
        "title": "Total Internal Reflection",
        "subtitle": "In 2018, Steven Hue was commissioned to compose the audio component for the artwork: Total Internal Reflection - a long-term interactive light installation at New Zealand’s national museum; Te Papa, by artist Tiffany Singh.",
        "copy":"The immersive installation, Total Internal Reflection draws specifically on Buddhist ideas and understandings of colour in the Vedas - more commonly understood as the chakras. Hue’s role was to compose and produce seven loopable soundscapes to correlate with the chakras and their colours. Participants could choose a colour and listen to the corresponding soundscape via a web application.\n\nHue researched the ideology that chakras are energised by specific musical notes, and that various musical instruments resonate with each chakra. As healing and wellbeing are integral themes of Singh’s work, abrasive sounds and timbres were not appropriate for this sonic palette.\n\nPaying close attention to these parameters, Hue assigned notes and instruments to the seven soundscapes accordingly, for example, the note for the exquisite “Heart” soundscape is F# and its dominant instrument is the piano.\n\nTo add variance between the soundscapes, Hue used a different tempo for each chakra; the beats per minute increased from the “Root” to the “Crown”. Hue used an array of sampled instruments, including: tabla, dhol, tanpura, violin, cello, piano, harpsichord, bassoon, clarinet, saxophone and flute. Hue also recorded his voice and acoustic guitar.\n\nThe installation premiered at Te Papa in March 2018 and is currently still on show. Total Internal Reflection won the gold award at the 2018 New Zealand Best Design Awards for spatial experience, and was the first social practise artwork acquired by Te Papa.",
        "media": [
            {
                "id": 1,
                "url": "https%3A//api.soundcloud.com/playlists/951431842%3Fsecret_token%3Ds-784mhFeyfbf&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&font-size: 10px; color: #cccccc;line-break: anywhere;word-break: normal;overflow: hidden;white-space: nowrap;text-overflow: ellipsis; font-family: Interstate,Lucida Grande,Lucida Sans Unicode,Lucida Sans,Garuda,Verdana,Tahoma,sans-serif;font-weight: 100;"
            }
        ]
    },
    "beyond_refuge": {
        "image": "refuge_bg.jpg",
        "title": "JOURNEY OF A MILLION MILES",
        "subtitle": "In 2017, Steven Hue was commissioned by social practise artist, Tiffany Singh, to compose a piece of music that would complement her installation: The Journey Of A Million Miles Begins With One Step - The Stories of Beyond Refuge.",
        "copy": "The installation featured five upcycled boats from Waiheke Island, New Zealand, that acted like sound shells for spoken-word stories from migrants, which laid bare their experiences of resettlement. The artwork aimed to humanise the politicisation of immigration within New Zealand.\n\nHue’s accompanying score had to resonate with the storyteller’s almost tangible emotions, and needed to play continuously throughout the exhibition as a single looping track without seeming repetitive. A further technical requirement was for the recorded narrations to be mixed with the score, alongside excerpts from broadcast media.\n\nHue perceived common emotional themes that connected each of the narrator’s stories: sadness, anxiety and hope. Thus inspired, Hue composed three separate movements that together comprised an emotive ambient score.\n\nHue used a minor chord progression to evoke sadness, which was accentuated with slow saxophone and filtered piano drenched in reverb. Hope was portrayed with a mix of warm synthetic bass, acoustic double bass, foley recordings, and layered violin. Hue manifested anxiety with sparse motifs, aggressive, staccato mid-range bass, and volume-automated hi-hats that simulated train travel to evoke a sense of journey and transitional change, which were key themes of Singh’s installation.\n\nHue performed one of the narrations at the eleventh hour when it was discovered the original recording was unusable. The finished file came in at around two hours in length.\n\nThe project was completed within Singh’s six-week deadline. The exhibition premiered to critical acclaim at Sculpture On The Gulf 2017, Waiheke Island, New Zealand. The Journey of a Million Miles exhibit was nominated for a prestigious International Award for Public Art.",
        "media": [
            {
                "id": 1,
                "url": "https%3A//api.soundcloud.com/tracks/321397149%3Fsecret_token%3Ds-kPC5GEjgzpe&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&visual=true&font-size: 10px; color: #cccccc;line-break: anywhere;word-break: normal;overflow: hidden;white-space: nowrap;text-overflow: ellipsis; font-family: Interstate,Lucida Grande,Lucida Sans Unicode,Lucida Sans,Garuda,Verdana,Tahoma,sans-serif;font-weight: 100;"
            }
        ]
    },
    "untitled_dream": {
        "image": "untitled_dream_bg.jpg",
        "title": "Untitled Dream",
        "subtitle": "“...a yearning vocal that floats through an ambiguous atmosphere.” ~ Exit Records",
        "copy": "After producing a stellar remix of Sixty Eight, a track by Steven Hue’s band Full Code, acclaimed producer Cam Consequence invited Hue to perform as a guest vocalist on his album, Test Dream.\n\nImprovising in response to the lush, euphoric mood of the track, Untitled Dream, Hue uses his voice as an instrument rather than a medium for spoken narrative. Hue added a contemporary twist to scat singing as he reacted to Consequence’s haunting music.\n\nThe vocals were recorded with a ramshackle dynamic microphone as opposed to the more traditional condenser microphone, which emphasises the vocals with a raw, unpolished characteristic.\n\nTest Dream was released on Exit Records in 2011.",
        "media": [
            {
                "id": 1,
                "url": "https://youtu.be/kJPEB7mU0Po"
            }
        ]
    },
    "epk": {
        "image": "../images/HueWeb.CloudTexture.2-1080p.jpg",
        "title": "Steven Hue",
        "subtitle": "Steven Hue is set to make his debut with five eclectic tracks.\n\nHue’s first offering represents a transitional period from band member to solo electronic artist.\n\nDan Murtagh produced and mixed the EP, and Kane Skinner features on drums on two tracks.\n\nHue’s live set is still a work-in-progress, with the end-goal being a collaborative act that incorporates live instruments and electronics.\n\nSteven Hue is an artist from New Zealand, currently based in Tasmania.\n\nHue is the former vocalist and co-writer for experimental band; Full Code (Full Code EP 2009, Telescapes 2014)\n\nIn 2015, Hue changed his modus operandi and began learning music production. Hue has since composed for art installations, short films, and games.\n\n",
        "copy":"Steven Hue is most at home in the body of the mind. Hue creates atmospheric soundscapes with a rich blend of electronic sounds and acoustic instrumentation. His evocative vocals stir memories from beyond the edge of conscious reason.\n\nSteven Hue is an artist from New Zealand, currently based in Tasmania.Hue is the former vocalist and co-writer for experimental band; Full Code (Full Code EP 2009, Telescapes 2014). In 2015, Hue changed his modus operandi and began learning music production. Hue has since composed for art installations, short films, and games.\n\n",
        "media": [
            {
                "id": 1,
                "url": "https%3A//api.soundcloud.com/playlists/1345436335&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&font-size: 10px; color: #cccccc;line-break: anywhere;word-break: normal;overflow: hidden;white-space: nowrap;text-overflow: ellipsis; font-family: Interstate,Lucida Grande,Lucida Sans Unicode,Lucida Sans,Garuda,Verdana,Tahoma,sans-serif;font-weight: 100;"
            },
            {
                "id": 2,
                "url": "https%3A//api.soundcloud.com/playlists/1360607029&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&font-size: 10px; color: #cccccc;line-break: anywhere;word-break: normal;overflow: hidden;white-space: nowrap;text-overflow: ellipsis; font-family: Interstate,Lucida Grande,Lucida Sans Unicode,Lucida Sans,Garuda,Verdana,Tahoma,sans-serif;font-weight: 100;"
            }
        ]
    },
    "returner": {
        "image": "hue.com-returner.jpg",
        "title": "Returner O",
        "subtitle": "Hue was commissioned by 3D-Artist, Maximilian Rötzler to compose music and design sound for a series of portfolio showcase videos, created from the mobile puzzle game 'Returner Zhero'.",
        "copy": "The videos highlight the assets and environments that were created by the art-team at Fantastic, yes. The game was released in 2018 to the Android and iOS market place. The 'Returner' games series has received praise by players and reviewers for its unique style, and high visual quality. The prequel, Returner-77 was awarded 'Best Indie Game in 2018', by Google Play.\n\nTo create the Sci-Fi sound effects, Hue utilised a range of sound design techniques, including sample layering, audio signal processing, and synthesis. Musically, Hue blended orchestral instruments, minimal rhythms, and dark synths, to create a modern, cinematic atmosphere. Additionally, Hue mixed and mastered the audio.",
        "media": [
            {
                "id": 1,
                "url": "https://vimeo.com/619626858"
            },
            {
                "id": 2,
                "url": "https://vimeo.com/619638395"
            },
            {
                "id": 3,
                "url": "https://vimeo.com/746416950"
            }
        ]
    },
    "menu" : [
        {
            "title": "Home",
            "route": "/",
            "children": []
        },
        {
            "title": "About",
            "route": "/about",
            "children": [
                {
                    "title": "Full Code",
                    "route": "/projects/fullcode",
                    "children": []
                },
                {
                    "title": "Challenge Haus",
                    "route": "/projects/challengehaus",
                    "children": []
                }
            ]
        },
        {
            "title": "Contact",
            "route": "/contact",
            "children": []
        }
    ]
}